In [1]:
import pymysql
import pandas as pd
import sqlalchemy as alch

In [2]:
import os
from dotenv import load_dotenv 
load_dotenv()

True

In [3]:
sql_password = os.getenv("SQL_password")

In [4]:
dbName = "women_representation"
connectionData=f"mysql+pymysql://root:{sql_password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

In [ ]:
query = '''

'''

pd.read_sql_query(query, engine)

In [ ]:
# 1
#percentage of each b_score
#also depending on year

In [ ]:
# 2
# best producing companies

In [ ]:
# 3
#relation btw b_score and incassi/votazione

In [ ]:
# 4
#correlation btw b_score and cast/crew gender

In [ ]:
# 5
#budget per film con regista/produttrice donna

In [ ]:
#1

In [5]:
# percentuale di film per ogni bechdel score
query = '''
SELECT bt_score AS Bechdel_score,
       COUNT(*) * 100.0 / (SELECT COUNT(*) FROM movies) AS percentage
FROM movies
GROUP BY bt_score
'''

pd.read_sql_query(query, engine)

   Bechdel_score  percentage
0              3    72.48134
1              2     6.53833
2              1    14.34023
3              0     6.64009

In [6]:
# percentuale di film nel corso degli anni per ogni bechdel score
query = '''
SELECT 
    release_year,
    SUM(CASE WHEN bt_score = 0 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt0_percentage,
    SUM(CASE WHEN bt_score = 1 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt1_percentage,
    SUM(CASE WHEN bt_score = 2 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt2_percentage,
    SUM(CASE WHEN bt_score = 3 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt3_percentage,
    COUNT(*) AS num_movies
FROM (SELECT title, bt_score, YEAR(STR_TO_DATE(release_date, '%%d/%%m/%%Y')) AS release_year
FROM movies) AS tab
GROUP BY release_year
ORDER BY release_year DESC;
'''

pd.read_sql_query(query, engine)

,release_year,bt0_percentage,bt1_percentage,bt2_percentage,bt3_percentage,num_movies
0,2020,0.0000,0.0000,100.0000,0.0000,1
1,2019,0.0000,0.0000,0.0000,100.0000,1
2,2018,50.0000,50.0000,0.0000,0.0000,2
3,2017,6.3492,21.4286,5.5556,66.6667,126
4,2016,6.9930,18.5315,10.8392,63.6364,286
...,...,...,...,...,...,...
120,1893,100.0000,0.0000,0.0000,0.0000,1
121,1891,100.0000,0.0000,0.0000,0.0000,2
122,1890,100.0000,0.0000,0.0000,0.0000,3
123,1888,100.0000,0.0000,0.0000,0.0000,1
124,1878,100.0000,0.0000,0.0000,0.0000,1

In [10]:
# percentuale di film nel corso dei decenni per ogni bechdel score
query = '''
SELECT 
    FLOOR(release_year / 10) * 10 AS decade,
    SUM(CASE WHEN bt_score = 0 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt0_percentage,
    SUM(CASE WHEN bt_score = 1 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt1_percentage,
    SUM(CASE WHEN bt_score = 2 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt2_percentage,
    SUM(CASE WHEN bt_score = 3 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt3_percentage,
    COUNT(*) AS num_movies
FROM (
    SELECT 
        title, 
        bt_score, 
        FLOOR(YEAR(STR_TO_DATE(release_date, '%%d/%%m/%%Y')) / 10) * 10 AS release_year
    FROM movies
) AS tab
GROUP BY decade
HAVING num_movies>100
ORDER BY decade DESC;
'''

pd.read_sql_query(query, engine)

,decade,bt0_percentage,bt1_percentage,bt2_percentage,bt3_percentage,num_movies
0,2010.0,7.1671,21.6285,9.4148,61.7897,2358
1,2000.0,6.1972,17.2636,6.8813,69.6579,2485
2,1990.0,4.2784,12.9381,5.2062,77.5773,1940
3,1980.0,5.6165,9.4900,4.7127,80.1808,1549
4,1970.0,6.4764,12.7333,4.8299,75.9605,911
5,1960.0,8.1115,11.2801,4.5627,76.0456,789
6,1950.0,5.9375,9.0625,6.2500,78.7500,640
7,1940.0,6.9307,8.5149,6.1386,78.4158,505
8,1930.0,4.3981,8.3333,7.6389,79.6296,432
9,1920.0,27.5229,9.1743,15.5963,47.7064,109

In [ ]:
#2

In [20]:
# percentuale di film per producing companies per ogni bechdel score
query = '''
SELECT 
    production_companies,
    SUM(CASE WHEN bt_score = 0 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt0_percentage,
    SUM(CASE WHEN bt_score = 1 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt1_percentage,
    SUM(CASE WHEN bt_score = 2 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt2_percentage,
    SUM(CASE WHEN bt_score = 3 THEN 1 ELSE 0 END) / COUNT(*) * 100 AS bt3_percentage,
    COUNT(*) AS num_movies
FROM (SELECT title, bt_score, production_companies
FROM production_companies) AS tab
GROUP BY production_companies
HAVING num_movies > 60
ORDER BY bt3_percentage DESC;
'''

pd.read_sql_query(query, engine)

,production_companies,bt0_percentage,bt1_percentage,bt2_percentage,bt3_percentage,num_movies
0,BBC Films,5.1948,9.0909,6.4935,79.2208,77
1,Fox Searchlight Pictures,1.6129,16.1290,9.6774,72.5806,62
2,Miramax,6.7308,14.4231,12.5000,66.3462,104
3,Canal+,8.0745,21.7391,5.5901,64.5963,161
4,StudioCanal,8.0000,25.3333,2.6667,64.0000,75
5,TriStar Pictures,6.6667,25.3333,10.6667,57.3333,75
6,Lionsgate,6.9767,20.9302,16.2791,55.8140,86
7,New Line Cinema,4.1667,27.7778,12.5000,55.5556,144
8,Walt Disney Pictures,4.4444,31.8519,8.1481,55.5556,135
9,Relativity Media,11.6279,24.4186,9.3023,54.6512,86
10,Universal Pictures,7.7889,23.3668,16.0804,52.7638,398
11,Touchstone Pictures,2.1053,31.5789,15.7895,50.5263,95
12,Metro-Goldwyn-Mayer,9.8214,23.6607,16.5179,50.0000,224
13,20th Century Fox,13.8264,25.4019,11.8971,48.8746,311
14,Paramount,9.5975,27.5542,14.2415,48.6068,323
15,Village Roadshow Pictures,7.3529,29.4118,14.7059,48.5294,68
16,Columbia Pictures,10.1639,29.1803,12.4590,48.1967,305
17,DreamWorks Pictures,7.7922,33.7662,10.3896,48.0519,77
18,Film4 Productions,13.2353,27.9412,11.7647,47.0588,68
19,Warner Bros. Pictures,6.5728,35.4460,13.1455,44.8357,426
20,Toho,26.0870,27.5362,5.7971,40.5797,69
21,United Artists,16.6667,34.0278,13.1944,36.1111,144

In [25]:
# producing company - average budget - average budget b_score=3
query = '''
SELECT 
    production_companies,
    AVG(budget)/1000000 AS avg_Mbudget,
    AVG(CASE WHEN bt_score = 3 THEN budget ELSE NULL END)/1000000 AS avg_Mbudget_bt3,
    COUNT(*) AS num_movies
FROM (SELECT title, bt_score, production_companies, budget
FROM production_companies
WHERE budget>0) AS tab
GROUP BY production_companies
HAVING num_movies > 40
ORDER BY avg_Mbudget_bt3-avg_Mbudget DESC; 
'''

# ordino mettendo per prime le producing company con maggiore differenza tra budget per bt_score3 e budget 
pd.read_sql_query(query, engine)

         production_companies  avg_Mbudget  avg_Mbudget_bt3  num_movies
0        Walt Disney Pictures    86.959926        91.939706         122
1         DreamWorks Pictures    64.166667        66.700000          75
2            20th Century Fox    38.974245        41.406570         249
3              Focus Features    17.792778        19.685185          45
4        Summit Entertainment    44.195982        45.875731          55
5             Dimension Films    22.890244        23.603448          41
6                 Screen Gems    27.560465        28.235714          43
7    Fox Searchlight Pictures    11.978536        12.359070          47
8               Sony Pictures    54.736585        54.864706          41
9                   Lionsgate    37.026887        36.881877          73
10        Working Title Films    28.594375        28.402414          48
11                StudioCanal    28.958311        28.087108          56
12      Warner Bros. Pictures    54.433864        53.325607         349
13  Village Roadshow Pictures    76.224242        74.281250          66
14             United Artists    13.783820        11.595377         104
15         Universal Pictures    42.590500        40.388697         332
16                  BBC Films    19.432705        16.623445          44
17                    Miramax    25.150515        22.331633          77
18            New Line Cinema    39.789023        36.905568         131
19                  Paramount    44.041429        40.914582         255
20                     Canal+    19.526224        16.198998          99
21          Columbia Pictures    49.973696        46.621351         250
22           TriStar Pictures    34.914286        31.560000          63
23         Dune Entertainment    61.283674        56.567857          49
24           Relativity Media    55.610465        47.723404          86
25        Regency Enterprises    47.265008        39.279415          49
26        Metro-Goldwyn-Mayer    32.914973        24.569338         144
27        Touchstone Pictures    44.968945        29.300000          81

In [ ]:
# 3

In [11]:
# Average of film popularity for each bechdel test value
query = '''
SELECT bt_score AS Bechdel_score, AVG(popularity) AS Average_Popularity
FROM movies
GROUP BY bt_score

'''

pd.read_sql_query(query, engine)

   Bechdel_score  Average_Popularity
0              3           14.866617
1              2           18.629012
2              1           21.486373
3              0           14.693101

In [15]:
# Average of revenues for each bechdel test value
query = '''
SELECT bt_score AS Bechdel_score, AVG(revenue)/1000000 AS Average_M_Revenue
FROM movies
GROUP BY bt_score

'''

pd.read_sql_query(query, engine)

   Bechdel_score  Average_M_Revenue
0              3          42.656416
1              2          59.530683
2              1          69.117048
3              0          37.285116

In [ ]:
# 4

In [32]:
# correlation btw b_score and cast gender
query = '''
SELECT     (
        COUNT(*) * SUM(female_ratio * bt_score) - SUM(female_ratio) * SUM(bt_score)
    ) / SQRT(
        (COUNT(*) * SUM(female_ratio * bt_score) - SUM(female_ratio) * SUM(female_ratio)) *
        (COUNT(*) * SUM(bt_score * bt_score) - SUM(bt_score) * SUM(bt_score))
    ) AS correlation
FROM 
(SELECT title, female_cast_count/num_actors AS female_ratio, bt_score FROM cast) AS tab

'''

pd.read_sql_query(query, engine)

   correlation
0     0.088603

In [33]:
#correlation btw b_score and crew gender
query = '''
SELECT     (
        COUNT(*) * SUM(female_ratio * bt_score) - SUM(female_ratio) * SUM(bt_score)
    ) / SQRT(
        (COUNT(*) * SUM(female_ratio * bt_score) - SUM(female_ratio) * SUM(female_ratio)) *
        (COUNT(*) * SUM(bt_score * bt_score) - SUM(bt_score) * SUM(bt_score))
    ) AS correlation
FROM 
(SELECT title, female_cast_count/num_crew AS female_ratio, bt_score FROM crew) AS tab

'''

pd.read_sql_query(query, engine)

   correlation
0    -0.017013

In [38]:
#
query = '''
SELECT bt_score AS Bechdel_score,
       AVG(female_ratio) AS avg_fem_ratio,
       AVG(male_ratio) AS avg_mal_ration,
       AVG(nonbinary_ratio) AS avg_nbin_ratio       
FROM (
SELECT title, bt_score, female_crew/num_crew AS female_ratio, male_crew/num_crew AS male_ratio,nonbinary_crew/num_crew AS nonbinary_ratio
FROM crew) AS tab
GROUP BY bt_score
'''

pd.read_sql_query(query, engine)

   Bechdel_score  avg_fem_ratio  avg_mal_ration  avg_nbin_ratio
0              3       0.149827        0.453575        0.000213
1              2       0.108328        0.518016        0.000108
2              1       0.102651        0.500121        0.000003
3              0       0.074292        0.533987        0.000000

In [ ]:
 # non si arriva a 100 perche c'erano anche valori unknown

In [ ]:
# 5
#budget per film con regista/produttrice donna